zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca91/pic32cz4010ca91176-pinctrl.h
/* pc21e_ebi_ncs3 */
#define PC21E_EBI_NCS3 MCHP_PINMUX(c, 21, e, periph)

/* pc21f_tcc6_wo0 */
#define PC21F_TCC6_WO0 MCHP_PINMUX(c, 21, f, periph)

/* pc22_gpio */
#define PC22_GPIO MCHP_PINMUX(c, 22, gpio, gpio)

/* pc22a_eic_extint6 */
#define PC22A_EIC_EXTINT6 MCHP_PINMUX(c, 22, a, periph)

/* pc22d_sercom4_pad1 */
#define PC22D_SERCOM4_PAD1 MCHP_PINMUX(c, 22, d, periph)

/* pc22e_ebi_ncs2 */
#define PC22E_EBI_NCS2 MCHP_PINMUX(c, 22, e, periph)

/* pc22f_tcc6_wo1 */
#define PC22F_TCC6_WO1 MCHP_PINMUX(c, 22, f, periph)

/* pc23_gpio */
#define PC23_GPIO MCHP_PINMUX(c, 23, gpio, gpio)

/* pc23a_eic_extint7 */
#define PC23A_EIC_EXTINT7 MCHP_PINMUX(c, 23, a, periph)

/* pc23d_sercom4_pad2 */
#define PC23D_SERCOM4_PAD2 MCHP_PINMUX(c, 23, d, periph)

/* pc23e_ebi_nbs0_a0 */
#define PC23E_EBI_NBS0_A0 MCHP_PINMUX(c, 23, e, periph)

/* pc23f_tcc5_wo0 */
#define PC23F_TCC5_WO0 MCHP_PINMUX(c, 23, f, periph)

/* pc24_gpio */
#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint8 */
#define PC24A_EIC_EXTINT8 MCHP_PINMUX(c, 24, a, periph)

/* pc24d_sercom4_pad3 */
#define PC24D_SERCOM4_PAD3 MCHP_PINMUX(c, 24, d, periph)

/* pc24e_ebi_a23 */
#define PC24E_EBI_A23 MCHP_PINMUX(c, 24, e, periph)

/* pc24f_tcc5_wo1 */
#define PC24F_TCC5_WO1 MCHP_PINMUX(c, 24, f, periph)

/* pc25_gpio */
#define PC25_GPIO MCHP_PINMUX(c, 25, gpio, gpio)

/* pc25a_eic_extint9 */
#define PC25A_EIC_EXTINT9 MCHP_PINMUX(c, 25, a, periph)

/* pc25d_sercom5_pad0 */
#define PC25D_SERCOM5_PAD0 MCHP_PINMUX(c, 25, d, periph)

/* pc25e_ebi_a21 */
#define PC25E_EBI_A21 MCHP_PINMUX(c, 25, e, periph)

/* pc25h_can2_rx */
#define PC25H_CAN2_RX MCHP_PINMUX(c, 25, h, periph)

/* pc26_gpio */
#define PC26_GPIO MCHP_PINMUX(c, 26, gpio, gpio)

/* pc26a_eic_extint10 */
#define PC26A_EIC_EXTINT10 MCHP_PINMUX(c, 26, a, periph)

/* pc26d_sercom5_pad1 */
#define PC26D_SERCOM5_PAD1 MCHP_PINMUX(c, 26, d, periph)

/* pc26e_ebi_a18 */
#define PC26E_EBI_A18 MCHP_PINMUX(c, 26, e, periph)

/* pc26h_can2_tx */
#define PC26H_CAN2_TX MCHP_PINMUX(c, 26, h, periph)

/* pc27_gpio */
#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint11 */
#define PC27A_EIC_EXTINT11 MCHP_PINMUX(c, 27, a, periph)

/* pc27d_sercom5_pad2 */
#define PC27D_SERCOM5_PAD2 MCHP_PINMUX(c, 27, d, periph)

/* pc27e_ebi_a12 */
#define PC27E_EBI_A12 MCHP_PINMUX(c, 27, e, periph)

/* pc27i_sdmmc1_sdwp */
#define PC27I_SDMMC1_SDWP MCHP_PINMUX(c, 27, i, periph)

/* pc28_gpio */
#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint12 */
#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

/* pc28d_sercom5_pad3 */
#define PC28D_SERCOM5_PAD3 MCHP_PINMUX(c, 28, d, periph)

/* pc28e_ebi_a10 */
#define PC28E_EBI_A10 MCHP_PINMUX(c, 28, e, periph)

/* pc28h_sqi1_cs1 */
#define PC28H_SQI1_CS1 MCHP_PINMUX(c, 28, h, periph)

/* pc28i_sdmmc1_sdcd */
#define PC28I_SDMMC1_SDCD MCHP_PINMUX(c, 28, i, periph)

/* pc29_gpio */
#define PC29_GPIO MCHP_PINMUX(c, 29, gpio, gpio)

/* pc29a_eic_extint13 */
#define PC29A_EIC_EXTINT13 MCHP_PINMUX(c, 29, a, periph)

/* pc29e_ebi_a7 */
#define PC29E_EBI_A7 MCHP_PINMUX(c, 29, e, periph)

/* pc29f_tcc4_wo0 */
#define PC29F_TCC4_WO0 MCHP_PINMUX(c, 29, f, periph)

/* pc29h_can3_rx */
#define PC29H_CAN3_RX MCHP_PINMUX(c, 29, h, periph)

/* pc30_gpio */
#define PC30_GPIO MCHP_PINMUX(c, 30, gpio, gpio)

/* pc30a_eic_extint14 */
#define PC30A_EIC_EXTINT14 MCHP_PINMUX(c, 30, a, periph)

/* pc30d_sercom6_pad0 */
#define PC30D_SERCOM6_PAD0 MCHP_PINMUX(c, 30, d, periph)

/* pc30e_ebi_a20 */
#define PC30E_EBI_A20 MCHP_PINMUX(c, 30, e, periph)

/* pc30h_sqi1_clk */
#define PC30H_SQI1_CLK MCHP_PINMUX(c, 30, h, periph)

/* pc30i_sdmmc1_sdck */
#define PC30I_SDMMC1_SDCK MCHP_PINMUX(c, 30, i, periph)

/* pc31_gpio */
#define PC31_GPIO MCHP_PINMUX(c, 31, gpio, gpio)

/* pc31a_eic_extint15 */
#define PC31A_EIC_EXTINT15 MCHP_PINMUX(c, 31, a, periph)

/* pc31d_sercom6_pad1 */
#define PC31D_SERCOM6_PAD1 MCHP_PINMUX(c, 31, d, periph)

/* pc31e_ebi_a19 */
#define PC31E_EBI_A19 MCHP_PINMUX(c, 31, e, periph)

/* pc31h_sqi1_data0 */
#define PC31H_SQI1_DATA0 MCHP_PINMUX(c, 31, h, periph)

/* pc31i_sdmmc1_sddat0 */
#define PC31I_SDMMC1_SDDAT0 MCHP_PINMUX(c, 31, i, periph)

/* pd0_gpio */
#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

/* pd0a_eic_extint0 */
#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

/* pd0m_gclk_io2 */
#define PD0M_GCLK_IO2 MCHP_PINMUX(d, 0, m, periph)

/* pd1_gpio */
#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

/* pd1a_eic_extint1 */
#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

/* pd1m_gclk_io3 */
#define PD1M_GCLK_IO3 MCHP_PINMUX(d, 1, m, periph)

/* pd2_gpio */
#define PD2_GPIO MCHP_PINMUX(d, 2, gpio, gpio)

/* pd2a_eic_extint2 */
#define PD2A_EIC_EXTINT2 MCHP_PINMUX(d, 2, a, periph)

/* pd2e_ebi_d3 */
#define PD2E_EBI_D3 MCHP_PINMUX(d, 2, e, periph)

/* pd2f_tcc9_wo4 */
#define PD2F_TCC9_WO4 MCHP_PINMUX(d, 2, f, periph)

/* pd2j_spi_ixs0_fsync */
#define PD2J_SPI_IXS0_FSYNC MCHP_PINMUX(d, 2, j, periph)

/* pd2k_eth_gtxer */
#define PD2K_ETH_GTXER MCHP_PINMUX(d, 2, k, periph)

/* pd3_gpio */
#define PD3_GPIO MCHP_PINMUX(d, 3, gpio, gpio)

/* pd3a_eic_extint3 */
#define PD3A_EIC_EXTINT3 MCHP_PINMUX(d, 3, a, periph)

/* pd3d_sercom3_pad0 */
#define PD3D_SERCOM3_PAD0 MCHP_PINMUX(d, 3, d, periph)

/* pd3e_ebi_d5 */
#define PD3E_EBI_D5 MCHP_PINMUX(d, 3, e, periph)

/* pd3f_tcc9_wo3 */
#define PD3F_TCC9_WO3 MCHP_PINMUX(d, 3, f, periph)

/* pd3j_spi_ixs0_sdi */
#define PD3J_SPI_IXS0_SDI MCHP_PINMUX(d, 3, j, periph)

/* pd3k_eth_gtx3 */
#define PD3K_ETH_GTX3 MCHP_PINMUX(d, 3, k, periph)

/* pd4_gpio */
#define PD4_GPIO MCHP_PINMUX(d, 4, gpio, gpio)

/* pd4a_eic_extint4 */
#define PD4A_EIC_EXTINT4 MCHP_PINMUX(d, 4, a, periph)

/* pd4d_sercom3_pad1 */
#define PD4D_SERCOM3_PAD1 MCHP_PINMUX(d, 4, d, periph)

/* pd4e_ebi_d8 */
#define PD4E_EBI_D8 MCHP_PINMUX(d, 4, e, periph)

/* pd4f_tcc9_wo0 */
#define PD4F_TCC9_WO0 MCHP_PINMUX(d, 4, f, periph)

/* pd4j_spi_ixs0_sck */
#define PD4J_SPI_IXS0_SCK MCHP_PINMUX(d, 4, j, periph)

/* pd4k_eth_gtx2 */
#define PD4K_ETH_GTX2 MCHP_PINMUX(d, 4, k, periph)

/* pd5_gpio */
#define PD5_GPIO MCHP_PINMUX(d, 5, gpio, gpio)

/* pd5a_eic_extint5 */
#define PD5A_EIC_EXTINT5 MCHP_PINMUX(d, 5, a, periph)

/* pd5d_sercom3_pad2 */
#define PD5D_SERCOM3_PAD2 MCHP_PINMUX(d, 5, d, periph)

